Revit 2027 API
Element.GetChangeTypeParameter(Parameter) Method
 Returns ChangeType associated with a change in a parameter's value
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ChangeType GetChangeTypeParameter(
	Parameter param
)
Public Shared Function GetChangeTypeParameter (
	param As Parameter
) As ChangeType
public:
static ChangeType^ GetChangeTypeParameter(
	Parameter^ param
)
static member GetChangeTypeParameter :
        param : Parameter -> ChangeType
Parameters
param Parameter
 Parameter for the ChangeType to trigger on
Return Value
ChangeType
 ChangeType that can be used to define a trigger for an Updater, triggering on parameter value change
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Use this change type to trigger an Updater when the value of an element's parameter changes. Note: This change type will not trigger on newly created or deleted elements.
See Also
Reference
Element Class
GetChangeTypeParameter Overload
Autodesk.Revit.DB Namespace